[
  {"id":"yu2010","type":"article-journal","title":"Prehistoric Phenomena and Self-referentiality","page":"13","source":"Zotero","abstract":"By terms-allowed-in-types capacity, the Logic of Proofs LP enjoys a system of advanced combinatory terms, while including types of the form t : φ(t), which have self-referential meanings. This paper suggests a research on possible S4 measures of self-referentiality introduced by this capacity. Speciﬁcally, we deﬁne “prehistoric phenomena” in G3s, a Gentzen-style formulation of modal logic S4. A special phenomenon, namely, “left prehistoric loop”, is then shown to be necessary for selfreferentiality in realizations of S4 theorems in LP.","language":"en","author":[{"family":"Yu","given":"Junhua"}],"issued":{"date-parts":[[2010]]}},
  {"id":"yu2014","type":"article-journal","title":"Prehistoric Graph in Modal Derivations and Self-Referentiality","container-title":"Theory of Computing Systems","page":"190-210","volume":"54","issue":"2","source":"Crossref","abstract":"By terms-allowed-in-formulas capacity, Artemov’s Logic of Proofs LP Artemov includes self-referential formulas of the form t :φ(t) that play a crucial role in the realization of modal logic S4 in LP, and in the Brouwer–Heyting–Kolmogorov semantics of intuitionistic logic via LP. In an earlier work appeared in the Proceedings of CSR 2010 the author deﬁned prehistoric loop in a sequent calculus of S4, and veriﬁed its necessity to self-referentiality in S4 → LP realization. In this extended version we generalize results there to T and K4, two modal logics smaller than S4 that yet call for self-referentiality in their realizations into corresponding justiﬁcation logics JT and J4.","URL":"http://link.springer.com/10.1007/s00224-013-9510-z","DOI":"10.1007/s00224-013-9510-z","ISSN":"1432-4350, 1433-0490","language":"en","author":[{"family":"Yu","given":"Junhua"}],"issued":{"date-parts":[[2014,2]]},"accessed":{"date-parts":[[2018,10,19]]}},
  {"id":"artemov2009","type":"paper-conference","title":"Logical omniscience as a computational complexity problem","container-title":"Proceedings of the 11th Conference on Theoretical Aspects of Rationality and Knowledge - TARK '09","publisher":"ACM Press","page":"14","source":"Crossref","event":"the 11th Conference","abstract":"The logical omniscience feature assumes that an epistemic agent knows all logical consequences of her assumptions. This paper offers a general theoretical framework that views logical omniscience as a computational complexity problem. We suggest the following approach: we assume that the knowledge of an agent is represented by an epistemic logical system E; we call such an agent not logically omniscient if for any valid knowledge assertion A of type F is known, a proof of F in E can be found in polynomial time in the size of A. We show that agents represented by major modal logics of knowledge and belief are logically omniscient, whereas agents represented by justiﬁcation logic systems are not logically omniscient with respect to t is a justiﬁcation for F .","URL":"http://portal.acm.org/citation.cfm?doid=1562814.1562821","DOI":"10.1145/1562814.1562821","ISBN":"978-1-60558-560-4","language":"en","author":[{"family":"Artemov","given":"Sergei"},{"family":"Kuznets","given":"Roman"}],"issued":{"date-parts":[[2009]]},"accessed":{"date-parts":[[2018,10,19]]},"publisher-place":"California"},
  {"id":"brezhnev2006","type":"article-journal","title":"Making knowledge explicit: How hard it is","container-title":"Theoretical Computer Science","page":"23-34","volume":"357","issue":"1-3","source":"Crossref","abstract":"Artemov’s logic of proofs LP is a complete calculus of propositions and proofs, which is now becoming a foundation for the evidence-based approach to reasoning about knowledge. Additional atoms in LP have form t: F , read as “t is a proof of F” (or, more generally, as “t is an evidence for F”) for an appropriate system of terms t called proof polynomials. In this paper, we answer two well-known questions in this area. One of the main features of LP is its ability to realize modalities in any S4-derivation by proof polynomials thus revealing a statement about explicit evidences encoded in that derivation. We show that the original Artemov’s algorithm of building such realizations can produce proof polynomials of exponential length in the size of the initial S4-derivation. We modify the realization algorithm to produce proof polynomials of at most quadratic length. We also found a modal formula, any realization of which necessarily requires self-referential constants of type c: A(c). This demonstrates that the evidence-based reasoning encoded by the modal logic S4 is inherently self-referential.","URL":"http://linkinghub.elsevier.com/retrieve/pii/S0304397506002623","DOI":"10.1016/j.tcs.2006.03.010","ISSN":"03043975","language":"en","author":[{"family":"Brezhnev","given":"Vladimir"},{"family":"Kuznets","given":"Roman"}],"issued":{"date-parts":[[2006,7]]},"accessed":{"date-parts":[[2018,10,19]]},"title-short":"Making knowledge explicit"},
  {"id":"baltag2012","type":"chapter","title":"The Logic of Justified Belief Change, Soft Evidence and Defeasible Knowledge","container-title":"Logic, Language, Information and Computation","publisher":"Springer Berlin Heidelberg","page":"168-190","volume":"7456","source":"Crossref","abstract":"We present a logic for reasoning about the evidence-based knowledge and beliefs and the evidential dynamics of non-logically -omniscient agents. We do this by adapting key tools and techniques from Dynamic Epistemic Logic, Justiﬁcation Logic, and Belief Revision so as to provide a lightweight, yet ﬁne-grained approach that characterizes well-known epistemic and doxastic attitudes in terms of the evidential reasoning that justiﬁes these attitudes. We then add the dynamic operations of evidence introduction, evidence-based inference, strong acceptance of new evidence (evidential “upgrade”), and irrevocable acceptance of additional evidence (evidential “update”). We exemplify our theory by providing a formal dynamic account of Lehrer’s well-known Gettier-type scenario involving the famous Ferrari and the infamous Messrs. Nogot and Havit.","URL":"http://link.springer.com/10.1007/978-3-642-32621-9_13","ISBN":"978-3-642-32620-2 978-3-642-32621-9","language":"en","collection-editor":[{"family":"Hutchison","given":"David"},{"family":"Kanade","given":"Takeo"},{"family":"Kittler","given":"Josef"},{"family":"Kleinberg","given":"Jon M."},{"family":"Mattern","given":"Friedemann"},{"family":"Mitchell","given":"John C."},{"family":"Naor","given":"Moni"},{"family":"Nierstrasz","given":"Oscar"},{"family":"Pandu Rangan","given":"C."},{"family":"Steffen","given":"Bernhard"},{"family":"Sudan","given":"Madhu"},{"family":"Terzopoulos","given":"Demetri"},{"family":"Tygar","given":"Doug"},{"family":"Vardi","given":"Moshe Y."},{"family":"Weikum","given":"Gerhard"}],"editor":[{"family":"Ong","given":"Luke"},{"family":"Queiroz","given":"Ruy","non-dropping-particle":"de"}],"author":[{"family":"Baltag","given":"Alexandru"},{"family":"Renne","given":"Bryan"},{"family":"Smets","given":"Sonja"}],"issued":{"date-parts":[[2012]]},"accessed":{"date-parts":[[2018,10,19]]},"publisher-place":"Berlin, Heidelberg","DOI":"10.1007/978-3-642-32621-9_13"},
  {"id":"fitting2009","type":"article-journal","title":"Realizations and LP","container-title":"Annals of Pure and Applied Logic","page":"368-387","volume":"161","issue":"3","source":"Crossref","abstract":"LP can be seen as a logic of knowledge with justifications. See [S. Artemov, The logic of justification, The Review of Symbolic Logic 1 (4) (2008) 477–513] for a recent comprehensive survey of justification logics generally. Artemov’s Realization Theorem says justifications can be extracted from validities in the more conventional Hintikka-style logic of knowledge S4, in which they are not explicitly present. Justifications, however, are far from unique. There are many ways of realizing each theorem of S4 in the logic LP. If the machinery of justifications is to be applied to artificial intelligence, or better yet, to everyday reasoning, we will need to work with whatever justifications we may have at hand—one version may not be interchangeable with another, even though they realize the same S4 formula. In this paper we begin the process of providing tools for reasoning about justifications directly. The tools are somewhat complex, but in retrospect this should not be surprising. Among other things, we provide machinery for combining two realizations of the same formula, and for replacing subformulas by equivalent subformulas. (The second of these is actually weaker than just stated, but this is not the place for a detailed formulation.) The results are algorithmic in nature—semantics for LP plays no role. We apply our results to provide a new algorithmic proof of Artemov’s Realization Theorem itself. This paper is a much extended version of [M.C. Fitting, Realizations and LP, in: S. Artemov, A. Nerode (Eds.), Logical Foundations of Computer Science—New York ’07, in: Lecture Notes in Computer Science, vol. 4514, Springer-Verlag, 2007, pp. 212–223].","URL":"http://linkinghub.elsevier.com/retrieve/pii/S016800720900147X","DOI":"10.1016/j.apal.2009.07.010","ISSN":"01680072","language":"en","author":[{"family":"Fitting","given":"Melvin"}],"issued":{"date-parts":[[2009,12]]},"accessed":{"date-parts":[[2018,10,19]]}},
  {"id":"scott1966","type":"chapter","title":"Assigning Probabilities to Logical Formulas","container-title":"Studies in Logic and the Foundations of Mathematics","publisher":"Elsevier","page":"219-264","volume":"43","source":"Crossref","URL":"http://linkinghub.elsevier.com/retrieve/pii/S0049237X08716720","ISBN":"978-0-444-53408-8","language":"en","author":[{"family":"Scott","given":"Dana"},{"family":"Krauss","given":"Peter"}],"issued":{"date-parts":[[1966]]},"accessed":{"date-parts":[[2018,10,19]]},"DOI":"10.1016/S0049-237X(08)71672-0"},
  {"id":"artemov2001","type":"article-journal","title":"EXPLICIT PROVABILITY AND CONSTRUCTIVE SEMANTICS","page":"36","source":"Zotero","abstract":"In 1933 Go¨ del introduced a calculus of provability (also known as modal logic S4) and left open the question of its exact intended semantics. In this paper we give a solution to this problem. We ﬁnd the logic LP of propositions and proofs and show that Go¨ del’s provability calculus is nothing but the forgetful projection of LP. This also achieves Go¨ del’s objective of deﬁning intuitionistic propositional logic Int via classical proofs and provides a Brouwer-Heyting-Kolmogorov style provability semantics for Int which resisted formalization since the early 1930s. LP may be regarded as a uniﬁed underlying structure for intuitionistic, modal logics, typed combinatory logic and -calculus.","language":"en","author":[{"family":"Artemov","given":"Sergei N"}],"issued":{"date-parts":[[2001,3]]}},
  {"id":"artemov2008","type":"article-journal","title":"THE LOGIC OF JUSTIFICATION","container-title":"The Review of Symbolic Logic","page":"477","volume":"1","issue":"04","source":"Crossref","abstract":"We describe a general logical framework, Justiﬁcation Logic, for reasoning about epistemic justiﬁcation. Justiﬁcation Logic is based on classical propositional logic augmented by justiﬁcation assertions t : F that read t is a justiﬁcation for F. Justiﬁcation Logic absorbs basic principles originating from both mainstream epistemology and the mathematical theory of proofs. It contributes to the studies of the well-known Justiﬁed True Belief vs. Knowledge problem. We state a general Correspondence Theorem showing that behind each epistemic modal logic, there is a robust system of justiﬁcations. This renders a new, evidence-based foundation for epistemic logic. As a case study, we offer a resolution of the Goldman–Kripke ‘Red Barn’ paradox and analyze Russell’s ‘prime minister example’ in Justiﬁcation Logic. Furthermore, we formalize the well-known Gettier example and reveal hidden assumptions and redundancies in Gettier’s reasoning.","URL":"http://www.journals.cambridge.org/abstract_S1755020308090060","DOI":"10.1017/S1755020308090060","ISSN":"1755-0203, 1755-0211","language":"en","author":[{"family":"Artemov","given":"Sergei"}],"issued":{"date-parts":[[2008,12]]},"accessed":{"date-parts":[[2018,10,19]]}},
  {"id":"troelstra2000","type":"book","title":"Basic proof theory","collection-title":"Cambridge tracts in theoretical computer science","collection-number":"43","publisher":"Cambridge University Press","number-of-pages":"417","edition":"2nd ed","source":"Library of Congress ISBN","ISBN":"978-0-521-77911-1","call-number":"QA9.54 .T76 2000","author":[{"family":"Troelstra","given":"A. S."},{"family":"Schwichtenberg","given":"Helmut"}],"issued":{"date-parts":[[2000]]},"publisher-place":"Cambridge ; New York"}
]
